{
  "oilFields": [

    {
      "name": "حقل نفط السرير ليبيا",
      "type": "حقل نفط",
      "image": "/assets/srir_libya.webp",
      "description": "اكتشف حقل سرير في جنوب برقة خلال عام 1961، ويُعتبر أكبر حقل نفط في ليبيا",
      "coordinates": [22.35, 26.94],
      "additionalInfos": {
        "overview": "حقل سرير هو أكبر حقل نفط في ليبيا ويُقدر احتياطي النفط بـ 12 مليار برميل (1.9 كم³). يقع على الحافة الغربية لبحر كالانشيو الرملي في الحافة الجنوبية الشرقية لحوض سرت. يُغطي الحقل نحو 378 كم² ويمتد طوله إلى حوالي 56 كم وعرضه 40 كم.",
        "location": "يقع حقل سرير في جنوب برقة، وهو جزء من مجمع ثلاثي الحقول. يحده من الشمال حقل سرير إل الذي يُغطي حوالي 39 كم². يقع بين الحقلين حوض شمال سرير الأصغر، والذي يُقدر احتياطي النفط فيه بنحو 1.2 مليار برميل.",
        "discovery_history": "تم منح الامتياز C-65 لشركة نيلسون بانكر هنت في عام 1957، وتم الحصول على حصة 50% من قبل شركة بي بي في عام 1960. بعد المسح الزلزالي الذي أظهر هياكل كبيرة في المنطقة، بدأت شركة بي بي الحفر في عام 1961، مما أدى إلى اكتشاف الحقل. كانت الأجهزة المستخدمة للكشف عن الغاز قد أظهرت نتائج إيجابية في البداية، وتم التحقق من وجود النفط في العينات التي تم سحبها من الآبار.",
        "production": "يُعد حقل سرير من أكثر الحقول النفطية إنتاجًا في ليبيا، وتشغله شركة الخليج العربي للنفط (AOG)، وهي شركة تابعة للمؤسسة الوطنية للنفط الليبية (NOC). يُعتبر الحقل من أهم مصادر النفط في البلاد، حيث يسهم بشكل كبير في صادرات النفط الليبية."
      },
      "additionalImages": [
        "/assets/srir_libya1.jpg",
        "/assets/srir_libya2.jpg"      ]
    },
    

    {
      "name": "حقل النفط والغاز الواحة ليبيا",
      "type": "حقل نفط",
      "image": "/assets/waha_libya.webp",
      "description": "حقل الواحة هو حقل نفطي يقع في حوض سرت الليبي تملكه شركة الواحة للنفط وتعتبر ثاني أكبر منتج للنفط والغاز بليبيا",
      "coordinates": [19.25, 26.94],
      "additionalInfos": {
        "overview": "حقل الواحة هو حقل نفطي يقع في حوض سرت الليبي وتملكه شركة الواحة للنفط التابعة للمؤسسة الوطنية للنفط (NOC). في عام 2006، بلغ إنتاجه حوالي 350,000 برميل يوميًا. في السابق كان الإنتاج يبلغ نحو 1 مليون برميل يوميًا في عام 1969، ثم انخفض إلى حوالي 400,000 برميل يوميًا في عام 1986. من المتوقع أن يزيد الإنتاج بمقدار 200,000 برميل يوميًا خلال العامين المقبلين.",
        "location": "يقع حقل الواحة في حوض سرت في ليبيا. يتم تشغيله من قبل شركة كونوكو فيليبس التي تمتلك حصة 16.33% في المشروع، بينما تمتلك المؤسسة الوطنية للنفط الحصة الأكبر بنسبة 59.17%. الشركاء الآخرون هم شركة ماراثون أويل بنسبة 16.33% ومؤسسة هس بنسبة 8.17%.",
        "discovery_history": "تم اكتشاف حقل الواحة في السبعينات، ومنذ ذلك الحين أصبح واحدًا من أهم حقول النفط في ليبيا. شهد الحقل فترة صعبة عندما سيطر عليه جنود تنظيم داعش في 5 مارس 2015، ولكن تم استعادته لاحقًا.",
        "production": "تعد شركة الواحة للنفط من أبرز منتجي النفط في ليبيا، حيث أسهمت بشكل كبير في تصدير النفط الليبي. في عام 2005، تم توقيع اتفاق مع شركة كونوكو فيليبس لتمديد امتياز الحقل لمدة 25 عامًا أخرى."
      },
      "additionalImages": [
        "/assets/waha_libya1.webp",
        "/assets/waha_libya2.jpg",
        "/assets/waha_libya3.jpg"
      ]
    },
    

    
    {
      "name": "حقل الشرارة (نفط)",
      "type": "حقل نفط",
      "image": "/assets/charara.jpg",
      "description": "حقل الشرارة للنفط، هو حقل نفط يقع في صحراء مرزق، ليبيا. أُكتشف عام 1980 وطورته شركة پتروم",
      "coordinates": [12.35, 26.94],
      "additionalInfos": {
        "overview": "حقل الشرارة هو أحد أكبر الحقول النفطية في ليبيا، يقع في صحراء مرزق، وقد تم اكتشافه عام 1980 من قبل شركة پتروم، وتديره حالياً شركة رپسول الإسبانية. يُعد من الحقول الرئيسية المنتجة للنفط في البلاد، حيث بلغت احتياطياته المؤكدة حوالي 3 مليارات برميل، بإنتاج يصل إلى 300,000 برميل يوميًا.",
        "location": "يقع حقل الشرارة في جنوب غرب ليبيا، ضمن صحراء مرزق. يرتبط الحقل بميناء الزاوية عبر خط أنابيب النفط الرئيسي في المنطقة الغربية، والذي تعرض للإغلاق عدة مرات بسبب النزاعات المسلحة.",
        "discovery_history": "تم اكتشاف حقل الشرارة عام 1980 وبدأ الإنتاج فيه لاحقًا، ليصبح أحد أهم الحقول النفطية في ليبيا. شهد الحقل اضطرابات عديدة أثرت على إنتاجه، كان أبرزها إغلاق خطوط الأنابيب من قبل مجموعات مسلحة، مما أدى إلى توقف الإنتاج لفترات طويلة.",
        "production": "يبلغ متوسط الإنتاج في حقل الشرارة حوالي 300,000 برميل يوميًا، إلا أنه تأثر بعدة أزمات، كان آخرها في يناير 2024 عندما توقف الإنتاج بسبب احتجاجات قبل أن يُستأنف لاحقًا برفع حالة القوة القاهرة. كما شهد عام 2014 انخفاضًا في الإنتاج نتيجة إغلاق أنبوب النفط من قبل مجموعات مسلحة، مما أثر سلبًا على إمدادات النفط الليبية."
      },
      "additionalImages": [
        "/assets/charara1.webp",
        "/assets/charara2.webp",
        "/assets/charara3.webp"
      ]
    },
    
    {
      "name": "حقل السدرة (نفط)",
      "type": "حقل نفط",
      "image": "/assets/sedra.webp",
      "description": "ميناء السدرة النفطي أحد موانئ تصدير النفط الليبية الرئيسية وأكبرها، يبعد حوالى 180 كم شرقي سرت",
      "coordinates": [18.41, 30.45],
      "additionalInfos": {
        "overview": "ميناء السدرة النفطي هو أكبر موانئ تصدير النفط في ليبيا، يقع على بُعد 180 كم شرق مدينة سرت. يربط الحقل بخطوط أنابيب نفطية تمتد لنحو 1400 كم قادمة من الحقول النفطية في الجنوب، مما يجعله مركزًا استراتيجيًا لصادرات النفط الليبي.",
        "location": "يقع ميناء السدرة على الساحل الليبي شرق سرت، وهو من أهم موانئ النفط في البلاد، حيث يعتمد على شبكة أنابيب طويلة تربطه بالحقول النفطية الرئيسية في الجنوب.",
        "infrastructure": "يحتوي ميناء السدرة على 4 مراسي مخصصة لسفن الشحن النفطي، إلى جانب 19 خزانًا تخزينيًا للنفط الخام بسعة إجمالية تبلغ 6.2 مليون برميل.",
        "historical_events": "شهد ميناء السدرة أحداثًا أمنية خطيرة، أبرزها الهجوم الذي شنته ميليشيات فجر ليبيا ودرع مصراتة في 13 ديسمبر 2014، ما أدى إلى تدمير 7 خزانات نفطية واشتعال النيران في بعضها بسبب القذائف الصاروخية، مما تسبب في أضرار بيئية جسيمة وسحب دخانية كثيفة شوهدت عبر الأقمار الصناعية.",
        "impact": "بسبب الهجوم الذي تعرض له في 2014، أعلنت المؤسسة الوطنية للنفط حالة القوة القاهرة على ميناءي السدرة وراس لانوف، مما أدى إلى تعليق تصدير حوالي 300 ألف برميل يوميًا من النفط الليبي."
      },
      "additionalImages": [
"/assets/sedra1.webp",
"/assets/sedra2.webp"
      ]
    },
    
    {
      "name":  "حقل البرمة (نفط وغاز)",
      "type": "حقل نفط وغاز",
      "image": "/assets/borma.jpg",
      "description": "حقل البرمة هو موقع لإنتاج النفط والغاز جنوب غرب الجمهورية التونسية في بيئة صحراوية بالقرب من الحدود التونسية الجزائرية وقد دخل حيز الإنتاج سنة 1963",
      "coordinates": [10.43, 32.30],
      "additionalInfos": {
        "overview": "حقل البرمة هو أحد أهم الحقول النفطية في تونس، يقع في الجنوب الغربي بالقرب من الحدود التونسية الجزائرية. تم اكتشافه عام 1964 من قبل الشركة الإيطالية التونسية لاستغلال النفط (SITEP) وبدأ الإنتاج الفعلي عام 1966، مما جعله نقطة تحول رئيسية في قطاع الطاقة التونسي.",
        "exploration_and_development": "كان اكتشاف حقل البرمة عام 1964 حافزًا للاستثمار في قطاع النفط التونسي، حيث تلاه اكتشافات عديدة مثل دولاب وسماسمة في أواخر الستينات، بالإضافة إلى الحقول البحرية مثل عشتروت ومسكار وصدربعل في السبعينات. ولكن أغلب الحقول المكتشفة بعد 1970 كانت صغيرة الحجم أو غير قابلة للتسويق لعدم توفر سوق محلية أو بسبب محدودية الاحتياطي.",
        "production_history": "دخل حقل البرمة طور الإنتاج عام 1966 بمعدل 5000 برميل يوميًا، وساهم في رفع الإنتاج الوطني الذي بلغ ذروته في عام 1980 بمعدل 117 ألف برميل يوميًا، حيث كان 70% منه يأتي من حقلي البرمة وعشتروت. مع بداية الثمانينات، بدأ الإنتاج في التراجع بسبب النضوب الطبيعي للحقول وانسحاب بعض الشركات الكبرى.",
        "energy_crisis_and_recovery": "شهدت تونس عجزًا طاقيًا متزايدًا منذ بداية القرن العشرين، مما دفع الدولة إلى تقديم حوافز جديدة للمستثمرين. ورغم التطورات في إنتاج الغاز، مثل مشروع نوارة في 2020، ظل الإنتاج غير قادر على تعويض التراجع الطبيعي للحقول القديمة، لكنه ساهم في تقليص العجز الطاقي.",
        "natural_gas_development": "بدأ استغلال الغاز الطبيعي في تونس عام 1972 من خلال تثمين غاز حقل البرمة وإنشاء أنبوب ناقل إلى قابس. لاحقًا، دخلت عدة حقول غازية طور الإنتاج مثل مسكار في 1996، والشرقي في 2008، وصدربعل في 2009. بحلول 2021، ارتفع إنتاج الغاز بنسبة 18% ليصل إلى 6.1 مليون م³ يوميًا."
      },
      "additionalImages": [
        "/assets/borma1.jpg",
        "/assets/borma2.jpg"
      ]
    }
    ,
    {
      "name": "حاسي مسعود (نفط)",
      "type": "حقل نفط",
      "image": "/assets/hasi_massoud.webp",
      "description": "تم اكتشاف الحقل في عام 1956، وهو أكبر حقل نفطي في الجزائر ويقع في حوض واد ميا، على بعد نحو 650 كيلومترًا جنوب شرق العاصمة الجزائر.",
      "coordinates": [6.07, 31.67],
      "additionalInfos": {
        "تاريخ الاكتشاف": "تم اكتشاف حقل حاسي مسعود في عام 1956، ليصبح العمود الفقري لقطاع النفط في الجزائر.",
        "الشركة المشغلة": "تتولى شركة سوناطراك تشغيل وإدارة حقل حاسي مسعود منذ اكتشافه.",
        "إجمالي الآبار": "يضم الحقل أكثر من 800 بئر منتشرة في المناطق المحيطة به.",
        "نسبة الاحتياطي المستنفد": "استُنفد ما يصل إلى 79% من احتياطيات الحقل القابلة للاستخراج.",
        "إنتاج النفط اليومي الحالي": "يبلغ إنتاج الحقل حاليًا نحو 470 ألف برميل من النفط الخام يوميًا.",
        "إنتاج الذروة": "بلغ إنتاج الحقل ذروته في عام 1977 عند 719.52 ألف برميل يوميًا.",
        "إنتاج عام 1970": "سجل الحقل إنتاجًا بلغ 500 ألف برميل يوميًا في عام 1970.",
        "إنتاج عام 2017": "انخفض الإنتاج إلى 430 ألف برميل يوميًا في عام 2017 ضمن اتفاق أوبك.",
        "مصفاة التكرير": "في عام 2021، أطلقت الجزائر عمليات بناء مصفاة تكرير بسعة 110 آلاف برميل يوميًا."
      },
      "additionalImages": [
        "/assets/hasi_massoud1.jpg",
        "/assets/hasi_massoud2.webp",
        "/assets/hasi_massoud3.jpg"
      ]
    }
    ,
    {
      "name": "حقل شنقيط (نفط)",
      "type": "حقل نفط",
      "image": "/assets/chenqit.jpg",
      "description": "حقل شنقيط النفطي هو أول حقل نفطي تجاري في موريتانيا، يقع قبالة الساحل الموريتاني على عمق 800 متر، وتم اكتشافه في عام 2001 من قبل شركة وودسايد بتروليوم الأسترالية.",
      "coordinates": [-12.30, 20.43],
      "additionalInfos": {
        "تاريخ الاكتشاف": "تم اكتشاف حقل شنقيط النفطي في عام 2001 من قبل شركة وودسايد بتروليوم الأسترالية.",
        "موقع الحقل": "يقع الحقل قبالة الساحل الموريتاني على عمق 800 متر تحت سطح البحر.",
        "تسمية الحقل": "تمت تسمية الحقل على اسم مدينة شنقيط الموريتانية.",
        "احتياطيات البداية": "قُدّرت احتياطيات الحقل الأولية بنحو 123 مليون برميل من النفط.",
        "بداية الإنتاج": "بدأ إنتاج النفط من الحقل في أوائل عام 2006 بمعدل 75,000 برميل يوميًا.",
        "انخفاض الإنتاج": "انخفض إنتاج الحقل سريعًا بعد التشغيل بسبب التعقيدات الجيولوجية.",
        "إعادة تقييم الاحتياطيات": "خفضت وودسايد تقديرات احتياطيات الحقل إلى 53 مليون برميل في نوفمبر 2006.",
        "الاستثمار في التطوير": "وافقت وودسايد على استثمار 600 مليون دولار أمريكي في تطوير الحقل عام 2004.",
        "التعديلات المثيرة للجدل": "أعلنت موريتانيا في 2006 أن تعديلات العقد مع وودسايد تمت خارج الإطار القانوني، ما قد يكلف البلاد 200 مليون دولار سنويًا.",
        "بيع الحقل": "تم بيع الحقل لاحقًا إلى مجموعة بتروناس الماليزية.",
        "توقف الإنتاج": "توقف إنتاج الحقل في ديسمبر 2017، وبدأ برنامج التخلي عنه في عام 2019.",
        "عقد التخلي": "في عام 2022، تم منح عقد التخلي لشركة هافرام النرويجية.",
        "إجمالي الإنتاج": "أنتج الحقل ما مجموعه 41 مليون برميل من النفط قبل توقفه.",
        "إجمالي مداخيل الدولة": "بلغت مداخيل الدولة الموريتانية من الحقل 450 مليون دولار أمريكي."
      },
      "additionalImages": [
        "/assets/chenqit1.jpg",
        "/assets/chenqit2.jpg"      ]
    }
    ,

    {
      "name": "حوض الصويرة",
      "type": "حقل نفط",
      "image": "/assets/swira2.webp",
      "description": "بدأ إنتاج الغاز في حوض الصويرة منذ ثمانينيات القرن الماضي، وما زال يواصل الإنتاج برخصة امتياز مسقالة.",
      "coordinates": [-7.37, 32.30],
      "additionalInfos": {
        "استمرار الاكتشافات": "تواصلت اكتشافات الغاز في المغرب خلال عام 2022، مما يعزز الآمال في تحقيق المزيد من الاكتشافات.",
        "تأثير الأزمة الدبلوماسية": "جاء الإعلان عن اكتشافات الغاز بعد أزمة دبلوماسية بين المغرب والجزائر في 2021، مما أدى إلى وقف أنبوب المغرب العربي وأوروبا.",
        "أهمية الغاز للمغرب": "يعتمد المغرب على اكتشافات الغاز لسد جزء من احتياجاته وتقليل الاستيراد، مع إمكانية تصدير الفائض.",
        "احتياطيات الغاز": "بلغت احتياطيات المغرب من الغاز الطبيعي 51 مليار قدم مكعبة يوميًا بنهاية عام 2021، وهو نفس الرقم المسجل في 2020."
      },
      "additionalImages": [
        "/assets/swira.jpg",
        "/assets/swira1.jpg",
        "/assets/swira3.jpg"
      ]
    }
    

    
  ],
  "gasFields": [
   
    {
      "name": "حقل نفط الواحة ليبيا",
      "type": "حقل نفط",
      "image": "/assets/waha_libya.webp",
      "description": "حقل الواحة هو حقل نفطي يقع في حوض سرت الليبي، تملكه شركة الواحة للنفط ويعد ثاني أكبر منتج للنفط والغاز في ليبيا.",
      "coordinates": [19.25, 26.94],
      "additionalInfos": {
        "إنتاج 2006": "أنتجت حقول الواحة حوالي 350,000 برميل يوميًا.",
        "إنتاج 1969": "بلغ إنتاج الحقل حوالي 1 مليون برميل يوميًا.",
        "زيادة الإنتاج المتوقعة": "من المتوقع أن يزيد الإنتاج بحوالي 200,000 برميل يوميًا خلال العامين المقبلين.",
        "الشركاء": "تشمل الشركاء شركة كونوكو فيليبس (16.33%)، المؤسسة الوطنية للنفط (59.17%)، ماراثون أويل (16.33%)، ومؤسسة هس (8.17%).",
        "السيطرة المؤقتة لداعش": "سيطر تنظيم داعش على الحقل في 2015، لكنه استعيد لاحقًا."
      },
      "additionalImages": [
        "/assets/waha_libya1.webp",
        "/assets/waha_libya2.jpg",
        "/assets/waha_libya3.jpg"
      ]
    }
    ,

    {
      "name": "حوض الصويرة",
      "type": "حقل نفط",
      "image": "/assets/swira2.webp",
      "description": "بدأ إنتاج الغاز في حوض الصويرة منذ ثمانينيات القرن الماضي، وما زال يواصل الإنتاج برخصة امتياز مسقالة.",
      "coordinates": [-7.37, 32.30],
      "additionalInfos": {
        "استمرار الاكتشافات": "تواصلت اكتشافات الغاز في المغرب خلال عام 2022، مما يعزز الآمال في تحقيق المزيد من الاكتشافات.",
        "تأثير الأزمة الدبلوماسية": "جاء الإعلان عن اكتشافات الغاز بعد أزمة دبلوماسية بين المغرب والجزائر في 2021، مما أدى إلى وقف أنبوب المغرب العربي وأوروبا.",
        "أهمية الغاز للمغرب": "يعتمد المغرب على اكتشافات الغاز لسد جزء من احتياجاته وتقليل الاستيراد، مع إمكانية تصدير الفائض.",
        "احتياطيات الغاز": "بلغت احتياطيات المغرب من الغاز الطبيعي 51 مليار قدم مكعبة يوميًا بنهاية عام 2021، وهو نفس الرقم المسجل في 2020."
      },
      "additionalImages": [
        "/assets/swira.jpg",
        "/assets/swira1.jpg",
        "/assets/swira3.jpg"
      ]
    }
    ,

    {
      "name": "حاسي الرمل (غاز)",
      "type": "حقل غاز",
      "image": "/assets/hassi_rmal.jpg",
      "description": "حقل حاسي رمل هو أكبر حقل غاز في الجزائر وواحد من أكبر حقول الغاز في العالم، يحتل المرتبة الرابعة عالميًا من حيث الإنتاج.",
      "coordinates": [3.28, 32.93],
      "additionalInfos": {
        "الموقع": "يقع في دائرة حاسي الرمل بولاية الأغواط على بعد 550 كيلومترًا جنوب عاصمة الجزائر.",
        "الطول والعرض": "يمتد الحقل 70 كيلومترًا من الشمال إلى الجنوب و50 كيلومترًا من الشرق إلى الغرب.",
        "اكتشاف الحقل": "تم اكتشافه عام 1956م، وبدأ الإنتاج في عام 1961م.",
        "الطاقة الإنتاجية": "تقدر الطاقة الإنتاجية السنوية لحقل حاسي الرمل بحوالي 100 مليار متر مكعب من الغاز الطبيعي.",
        "النقل": "يتم نقل الغاز إلى مدن ساحلية مثل أرزيو، الجزائر وسكيكدة.",
        "الأنابيب": "يغذي الحقل خطوط أنابيب تصدير مثل خط أنابيب الغاز المغرب-أوروبا والميدغاز والگالسي.",
        "محطة توليد الكهرباء": "يوجد في بلدية حاسي رمل أكبر محطة لتوليد الكهرباء في الجزائر."
      },
      "additionalImages": [
        "/assets/hassi_rmal2.webp",
        "/assets/hassi_rmal1.jpg",
        "/assets/hassi_rmal3.jpg"

      ]
    }
    ,
    {
      "name": "حقل البرمة للغاز تونس",
      "type": "حقل غاز",
      "image": "/assets/borma.jpg",
      "description": "حقل البرمة هو موقع لإنتاج النفط والغاز جنوب غرب تونس في بيئة صحراوية بالقرب من الحدود الجزائرية. دخل حيز الإنتاج سنة 1963.",
      "coordinates": [9.38, 32.66],
      "additionalInfos": {
        "الموقع": "يقع جنوب غرب تونس، بالقرب من الحدود الجزائرية.",
        "تاريخ الاكتشاف والإنتاج": "دخل الحقل طور الإنتاج عام 1966 بمعدل 5000 برميل يوميًا.",
        "الاتفاقيات": "تم توقيع اتفاقية بين تونس وشركتي إيني وسيتاب لحفر بئر جديدة ومسار جانبي بحقل البرمة.",
        "الاستثمار": "تبلغ تكلفة المشروع 19 مليون دولار، ضمن خطة لحفر 9 آبار جديدة بين 2025 و2030.",
        "الإنتاج": "بلغ إجمالي إنتاج الحقل 118 مليون متر مكعب قياسي في 2023، مع 285 مليار متر مكعب من الغاز.",
        "الآبار": "يضم 46 بئرًا منتجة للنفط، وبئرًا واحدة منتجة للغاز، و18 بئرًا لحقن المياه.",
        "إمدادات الغاز": "ينتج يوميًا 103 ملايين متر مكعب من الغاز المصاحب و15.5 ألف متر مكعب من الغاز الجاف."
      },
      "additionalImages": [
        "/assets/borma1.jpg",
        "/assets/borma2.jpg"
      ]
    }
    ,
   
    {
      "name": "حقل السلحفاة (غاز)",
      "type": "حقل غاز",
      "image": "/assets/solahfet.webp",
      "description": "يُعد حقل السلحفاة آحميم من أكبر الحقول الغازية بين موريتانيا والسنغال، وتُقدر احتياطاته بـ 25 تريليون قدم مكعب.",
      "coordinates": [-15.13, 17.17],
      "additionalInfos": {
        "الموقع": "يقع على الحدود البحرية بين موريتانيا والسنغال.",
        "الإنتاج": "بدأ إنتاج الغاز رسميًا بعد نجاح فتح البئر الأولى، مما يمهد الطريق لتسويق الغاز قريبًا.",
        "أهمية المشروع": "يعد المشروع إحدى أكبر الاكتشافات الغازية فائقة العمق في البحر، ويمثل محطة فارقة في تعزيز الشراكة بين البلدين.",
        "الاحتياطات": "تُقدر احتياطات الحقل بـ 25 تريليون قدم مكعب من الغاز.",
        "خطط موريتانيا": "موريتانيا تمتلك احتياطات غاز تقدر بأكثر من 100 تريليون قدم مكعب، وتسعى لاستغلال حقولها الغازية بشكل مستدام.",
        "التنمية الاقتصادية": "يهدف المشروع إلى تحسين اقتصاد البلدين وتوفير فرص عمل، خاصة في ظل ارتفاع نسبة البطالة.",
        "الشركات المشغلة": "تتولى عمليات التطوير شركتا BP وكوزمو إنرجي، وهو مشروع الغاز الطبيعي المسال الأول في السنغال."
      },
      "additionalImages": [
        "/assets/solahfet1.webp",
        "/assets/solahfet2.jpg"
      ]
    }
    
  ],
  "ironFields": [
    {
      "name": "منجم الحديد وادي الشاطئ ليبيا",
      "type": "خام الحديد",
      "image": "/assets/wedi2.webp",
      "description": "تقع ترسبات الحديد بمنطقة وادي الشاطئ جنوب غرب ليبيا، وتمتد في حزام يبلغ طوله 200 كم وعرضه 20 كم، يحده من الشمال جبل الحساونة ومن الجنوب رمال الزلاف.",
      "coordinates": [13.07, 27.18],
      "additionalInfos": {
        "الموقع الجغرافي": "يقع في جنوب غرب ليبيا، ويعتبر من أكبر رواسب خام الحديد في البلاد.",
        "الجيولوجيا": "يتواجد ضمن حزام من الصخور الرسوبية التي تعود إلى العصر الديفوني العلوي والعصر الكربوني السفلي، ويتكون من نطاقين أساسيين يفصل بينهما طبقات طينية.",
        "أنواع الخام": "يوجد نوعان رئيسيان: خام الحديد المؤكسد (الهيماتيت، الليمونايت) وخام الحديد المختزل (الجنيتايت، السيدرايت).",
        "الاحتياطيات": "الاحتياطيات المؤكدة في عدسة تاروت تُقدر بحوالي 900 مليون طن، بينما تشمل الاحتياطات المحتملة:\n- عدسة أشكدة: 500 مليون طن\n- عدسة الرويسة: 750 مليون طن\n- إجمالي الاحتياطات المحتملة تتجاوز 5 مليار طن.",
        "الاستخدامات": "يُستخدم خام الحديد في:\n1. صناعة الحديد والصلب عبر الأفران اللافحة والاختزال بفحم الكوك.\n2. صناعة الأسمنت كمادة تصحيحية في الخلطات، حيث تستثمره شركات الأسمنت في عدة مواقع."
      },
      "additionalImages": [
        "/assets/wedi1.jpg",
        "/assets/wedi.jpg"
      ]
    },
    
    
    {
      "name": "منجم الزويرات",
      "type": "خام الحديد",
      "image": "/assets/zwiret1.webp",
      "description": "تُعد مناجم الزويرات في شمال موريتانيا من أبرز المعالم الصناعية والاقتصادية، حيث يتم استخراج خام الحديد عالي الجودة منها.",
      "coordinates": [-12.48, 22.73],
      "additionalInfos": {
        "تاريخ الاكتشاف والاستغلال": "بدأ استغلال مناجم الزويرات في الخمسينات من القرن العشرين، قبيل استقلال موريتانيا، من قبل شركة 'حديد موريتانيا - ميفارما'.",
        "أول شحنة": "تم تصدير أولى شحنات خام الحديد من الزويرات عام 1963.",
        "جودة الخام": "يتميز خام الحديد في الزويرات بجودته العالية، حيث تبلغ نسبة تركيز الحديد فيه 80.64%.",
        "التأميم والإدارة": "بعد تأميم الشركة المشغلة، انتقلت حقوق الامتياز إلى 'الشركة الوطنية للصناعة والمعادن - سنيم'، والتي تدير عمليات الاستخراج والإنتاج.",
        "الإنتاج السنوي": "وصل إنتاج خام الحديد في بعض السنوات إلى 12 مليون طن."
      },
      "additionalImages": [
        "/assets/zwiret.jpg",
        "/assets/zwiret2.webp"
      ]
    }
    ,
    {
      "name": "منجم الحديد - جبل جريسة",
      "type": "خام الحديد",
      "image": "/assets/jbal_jrisa1.jpg",
      "description": "تأسست شركة جبل جريسة عام 1907 لاستغلال خام الحديد في منطقة الجريصة بولاية الكاف، وكانت من أبرز الشركات التونسية في القطاع المعدني.",
      "coordinates": [8.72, 35.78],
      "additionalInfos": {
        "تاريخ التأسيس": "1907",
        "الأهمية الاقتصادية": "كانت أول شركة تونسية والخامسة عشرة في فرنسا من حيث رسملة السوق عام 1949.",
        "الإدارة التاريخية": "بين 1945 و1962، أدار الشركة هنري لافون، الذي كان أيضًا مديرًا لبنك الاتحاد الباريسي وشركات فوسفات وسكك حديد قفصة والونزة والنفط الفرنسية.",
        "تطور الصناعة": "في الستينات، بدأت الشركة بتزويد منتجي الصلب المحليين، ثم تحولت لاحقًا إلى إنتاج السيدريت وتسويقه، ومع تراجع احتياطي الهيماتيت، بدأت الشركة بالاهتمام بتزويد سوق الإسمنت بعد 1978.",
        "الإنتاج والتصدير": "ارتفع إنتاج خام الحديد من 4.5 مليون طن إلى 6.4 مليون طن عام 2009، وتم تصدير حوالي 15 مليون طن من كربونات الحديد إلى أوروبا لتغذية الماشية.",
        "إغلاق المصانع": "في عام 2003، تم إغلاق فرن صهر المعادن وخُصخصت أربعة مصانع إسمنت من أصل ستة."
      },
      "additionalImages": [
        "/assets/jbal_jrisa.jpg",
        "/assets/jbal_jrisa2.jpg"
      ]
    }
    
  ],
  "phosphateFields": [
    {
      "name": "منجم الفسفاط - قفصة",
      "type": "فسفاط",
      "image": "/assets/fosfat_gafsa.jpg",
      "description": "شركة فسفاط قفصة هي مؤسسة عمومية خفية الإسم ذات طابع صناعي وتجاري، هدفها استغلال مناجم الفسفاط بالبلاد التونسية.",
      "coordinates": [8.58, 34.42],
      "additionalInfos": {
        "تاريخ الاكتشاف": "اكتشف البيطري الفرنسي فيليب توماس الفسفاط بقفصة خلال بحوثه الاستكشافية في أفريل من سنة 1885 بين جبل الثالجة ورأس العيون.",
        "تاريخ التأسيس": "1897",
        "أول مجلس إدارة": "انعقد أول مجلس إدارة للشركة بتاريخ 5 أفريل 1897 وانتخب دلفوس غالين رئيسًا له.",
        "المحطات التاريخية": [
          "1885: اكتشاف الفسفاط بجبال الثالجة من قبل الفرنسي فيليب توماس",
          "1896: تأسيس شركة الفسفاط والسكك الحديدية",
          "1899: فتح منجم المتلوي",
          "1903: فتح منجم الرديف",
          "1904: فتح منجم أم العرائس",
          "1905: تأسيس الشركة التونسية لاستغلال الفسفاط وبداية استغلال منجم القلعة الخصبة بجهة الكاف",
          "1920: تأسيس الشركة الجديدة لفسفاط جبل المظيلة وبداية استغلال منجم المظيلة",
          "1969: اندماج شركة جبل المظيلة مع شركة الفسفاط والسكك الحديدية",
          "1970: فتح منجم صهيب بالمظيلة",
          "1976: اندماج كل شركات الفسفاط في شركة واحدة هي شركة فسفاط قفصة",
          "1978: فتح مقطع كاف الشفاير بالمتلوي",
          "1980: فتح مقطع أم الخشب",
          "1984: فتح قسم كاف الدور",
          "1986: فتح مقطع وادي الخسفة بالمظيلة",
          "1991: فتح مقطع الجلابية بالمظيلة",
          "1995: فتح مقطع المائدة الشمالية بأم العرائس",
          "1994: بعث إدارة عامة موحدة تنسق بين شركة فسفاط قفصة والمجمع الكيميائي"
        ]
      },
      "additionalImages": [
        "/assets/fosfat_gafsa1.jpg",
        "/assets/fosfat_gafsa2.webp"
      ]
    }
    
    
    ,
    {
      "name": "منجم الفسفاط - جبل العنق",
      "type": "فسفاط",
      "image": "/assets/jbal_onk2.jpg",
      "description": "منجم جبل العنق هو منجم يقع في ولاية تبسة. يمثل جبل العنق واحداً من أكبر احتياطي الفوسفات في الجزائر حيث يقدر احتياطاته بنحو 2.8 مليار طن من الخام.",
      "coordinates": [8.05, 34.62],
      "additionalInfos": {
        "موقع المنجم": "يقع في ولاية تبسة، الجزائر.",
        "الاحتياطي": "يقدر الاحتياطي بحوالي 2.8 مليار طن من الفوسفات الخام.",
        "نسبة الفوسفور": "يحتوي الخام على حوالي 24% من خماسي أكسيد الفوسفور.",
        "الأهمية الاقتصادية": "يعد جبل العنق أحد أهم موارد الفوسفات في الجزائر، حيث يساهم بشكل كبير في الاقتصاد المحلي وصادرات الفوسفات.",
        "الاستخدامات": "يستخدم الفوسفات المستخرج من جبل العنق في إنتاج الأسمدة والصناعات الكيميائية."
      },
      "additionalImages": [
        "/assets/jbal_onk1.webp",
        "/assets/jbal_onk.webp"
      ]
    }
    ,
    {
      "name": "منجم الفسفاط - خريبكة",
      "type": "فسفاط",
      "image": "/assets/khribka.jpg",
      "description": "نتج مدينة خريبكة الجزء الأكبر من معدن الفوسفات الذي يتوفر في المغرب بحجم يصل إلى نحو 70% من احتياطياته.",
      "coordinates": [-6.90, 32.88],
      "additionalInfos": {
        "تاريخ نشأة الفوسفات": "بدأت نشأة الفوسفات المغربي منذ نحو 72 مليون سنة في الحقبة الجيولوجية المعروفة بالعصر الطباشيري.",
        "استغلال الفوسفات": "في أوائل القرن الماضي، بدأ استغلال فوسفات مدينة خريبكة وضواحيها خلال فترة الاستعمار الفرنسي.",
        "دور الفوسفات في الاقتصاد": "أصبح الفوسفات ومشتقاته والصناعات المرتبطة به محور الحياة للسكان المحليين والعمال المشتغلين في المناجم.",
        "جبال الفوسفات": "عند الاقتراب من مدينة خريبكة، يمكن رؤية جبال ضخمة من مخلفات الفوسفات، التي تحكي قصة قرن من الزمن في الصناعة.",
        "الأهمية الاقتصادية": "ساهمت خريبكة في توفير موارد مهمة من العملة الصعبة للاقتصاد المغربي."
      },
      "additionalImages": [
        "/assets/khribka1.jpg",
        "/assets/khribka2.jpeg"
      ]
    }
    ,
    {
      "name": "منجم الفسفاط - بن كرير",
      "type": "فسفاط",
      "image": "/assets/bn_krir.jpeg",
      "description": "افتتح المنجم في بن جرير عام 1980، ويقع على بعد 70 كم شمال مراكش. في عام 2016 ... أول موقع كيميائي لمجموعة المكتب الشريف فسفاط.",
      "coordinates": [-7.37, 32.30],
      "additionalInfos": {
        "أهمية الفوسفات في المغرب": "المغرب يعد أحد أكبر الدول المنتجة للفوسفاط، وهو يشكل الثروة الوطنية الأولى للمغرب، حيث يملك 75% من الاحتياطي العالمي.",
        "المناطق الرئيسية للفوسفات": "يتم توزيع الاحتياطي العالمي للفوسفات بين أربع مناطق أساسية: بن جرير، بوكراع، خريبكة، وأسفي.",
        "التاريخ والاستخراج": "بدأ استغلال منجم بن جرير في سنة 1980. خلال المرحلة الأولى (1980-1994)، كان يتم استخراج 3.1 مليون طن من الفوسفات سنويًا.",
        "زيادة الإنتاج": "خلال المرحلة الثانية (1994-2018)، ارتفع الإنتاج ليصل إلى 4.5 مليون طن سنويًا، وهو ما يمثل 30% من الإنتاج الإجمالي للمجمع.",
        "النقل": "بعد الاستخراج، يتم نقل خام الفوسفات إلى مصانع الكيماويات في آسفي والجرف الأصفر عبر البر أو السكك الحديدية.",
        "التصدير": "يتم تصدير الفوسفات عبر ميناء خام لآسفي."
      },
      "additionalImages": [
        "/assets/bn_krir1.jpeg",
        "/assets/bn_krir2.jpeg"
      ]
    }
    ,

    {
      "name": "بوكراع",
      "type": "حقل نفط",
      "image": "/assets/boukraa.jpg",
      "description": "يمثل هذا المنجم نسبة 8% من إجمالي صخور الفوسفاط بالمغرب، كما يشكل حوالي 2% من إجمالي احتياط الفوسفاط في المغرب.",
      "coordinates": [-12.52, 26.63],
      "additionalInfos": {
        "موارد الطاقة": "تزخر أراضي الصحراء الغربية باحتياطات واعدة من النفط والغاز والفحم الحجري، مما دفع العديد من الشركات الأجنبية إلى البحث والتنقيب في المنطقة منذ الستينيات.",
        "الحوض الرسوبي": "تتواجد الصحراء الغربية على ثلاثة أحواض رسوبية رئيسية، مما يجعلها مصنفة من الأحواض البترولية المهمة. تمتلك المنطقة حقولًا كبيرة من النفط والغاز الطبيعي.",
        "استكشافات النفط": "شركات مثل انتربرايز أويل وإسسو، وكذلك توتال فينال إلف، قامت بدراسات استكشافية على المياه الإقليمية للصحراء الغربية، مما يدل على وجود احتياطيات هامة من النفط.",
        "الطاقة المتجددة": "تتوفر الصحراء الغربية أيضًا على مصادر هامة من الطاقة المتجددة مثل الشمس والرياح والمياه (مد وجزر المحيط)، مما يوفر إمكانيات لتوليد طاقة كهربائية في المناطق النائية.",
        "التنقيب والتعاون الدولي": "في مايو 2005، أعلنت الحكومة الصحراوية عن مناقصة دولية للتنقيب عن النفط والغاز في الصحراء الغربية. تم توقيع اتفاقيات مع تسع شركات بريطانية لتنفيذ عمليات استكشافية في تسع مناطق مختلفة على الساحل الصحراوي.",
        "التوجه السياسي": "من خلال هذه الاتفاقات، تسعى الدولة الصحراوية لتعزيز استقلالها السياسي والاقتصادي في مواجهة الادعاءات المغربية، على أمل تسوية قضية الصحراء الغربية."
      },
      "additionalImages": [
"/assets/boukraa1.jpg",
"/assets/boukraa2.jpg"      ]
    }
    ,


    {
      "name": "منجم فسفاط كيهيدي موريتانيا",
      "type": "حقل فسفاط",
      "image": "/assets/kihidi.jpg",
      "description": "المنجم الذي حاولت موريتانيا استغلالها منذ ثمانينيات القرن الماضي دون جدوى، يقع على بعد 470 كلم جنوب شرق نواكشوط، بالقرب من الحدود مع السنغال.",
      "coordinates": [-13.52, 16.23],
      "additionalInfos": {
        "مدينة كيهيدي": "كيهيدي هي مدينة موريتانية يبلغ عدد سكانها قرابة 60 ألف نسمة، وهي أكبر مدن ولاية كوركول وعاصمتها. تقع على بعد حوالي 435 كم من العاصمة نواكشوط.",
        "الموقع الجغرافي": "تقع المدينة في منطقة شماما وهي منطقة نهرية تمتد على طول نهر السنغال الذي يربط مع نهر غورغول، مما يجعلها واحدة من المناطق الزراعية المستقرة في البلاد.",
        "الثقافة": "تعكس مدينة كيهيدي الثقافة السنغالية بشكل أكبر من الثقافات المغاربية/العربية الموجودة في شمال البلاد، خاصةً في مبانيها وأسواقها.",
        "الصراع العرقي": "تأثرت كيهيدي بالصراع العرقي في عام 1989، الذي أثر على اقتصادات المنطقة، ولكنها بدأت في التعافي بشكل تدريجي.",
        "التنمية": "في عام 2008، تم توقيع اتفاق مع المصالح الصينية لبناء خط للسكك الحديدية من كيهيدي إلى العاصمة نواكشوط بهدف نقل الفوسفات وتنظيم حركة المرور."
      },
      "additionalImages": [
        "/assets/kihidi1.jpg",
        "/assets/kihidi2.jpg"
      ]
    }
    

  ]
}
