[
  {
    "name": "الصحراء الكبرى",
    "type": "deserts",
    "position": [26, 4],
    "description": "أكبر صحراء حارة في العالم، تمتد عبر شمال إفريقيا من البحر الأحمر إلى المحيط الأطلسي. تغطي حوالي 9 مليون كم² وتتميز بتضاريس متنوعة مثل الكثبان الرملية، الهضاب، والبحيرات الجافة. المناخ جاف جدًا مع أمطار نادرة. تعد قمة إيمي كوسي هي الأعلى في الصحراء (3415 متر).",
    "image": "assets/topology/bigsahara.webp",
    "additional_images": [
      "assets/topology/bigsahara1.jpg",
      "assets/topology/bigsahara2.jpg",
"assets/topology/bigsahara4.jpg"    ]
  }
  ,
  {
    "name": "الصحراء الليبية",
    "type": "deserts",
    "position": [23, 23],
    "description": "جزء من الصحراء الكبرى، تمتد عبر ليبيا ومصر والسودان. تحتوي على مناطق صحراوية واسعة، مثل بحر الرمال العظيم، منخفضات مثل القطارة، بالإضافة إلى جبال أكاكوس والعديد من الواحات مثل واحة سيوة. كانت طريقًا تجاريًا هامًا في الماضي.",
    "image": "assets/topology/desertlibya.webp",
    "additional_images": [
      "assets/topology/desertlibya1.png",
      "assets/topology/desertlibya2.webp",
      "assets/topology/desertlibya3.jpg"
    ]
  }
  ,
  {
    "name": "عرق مرزوق",
    "type": "deserts",
    "position": [24, 12],
    "description": "صحراء مرزق أو إدهان مرزق هي عبارة عن عرق في جنوب غرب ليبيا وتبلغ مساحتها حوالي 58,000 كيلومتر مربع. سميت باسم مدينة مرزق في فزان. مثل ادهان أوباري في الشمال، تعتبر صحراء مرزق جزءًا من منطقة الصحراء الكبرى. يفصلها عن الصحراء الجنوبية جبال تيبستي وطاسيلي ناجر.",
    "image": "assets/topology/marzaqsahara.jpg",
    "additional_images": [
      "assets/topology/marzaqsahara1.jpg",
      "assets/topology/marzaqsahara2.jpg",
      "assets/topology/marzaqsahara3.jpg"
    ]
  }
  ,
  {
    "name": "العرق الشرقي الكبير",
    "type": "deserts",
    "position": [28.5, 7],
    "description": "العرق الشرقي الكبير هو واحد من أكبر حقول الكثبان الرملية في الصحراء الكبرى، يمتد عبر جنوب شرق الجزائر وشمال تونس بمساحة تقدر بـ 190,000 كم². يتكون من كثبان رملية يصل ارتفاعها إلى 250 متراً، تفصله هضاب صخرية عن العرق الغربي الكبير. يعد جزءًا من النظام البيئي الصحراوي الجاف، حيث تتدفق إليه المياه النادرة عبر وادي إيغرغر تحت الرمال.",
    "image": "assets/topology/charqi3.jpg",
    "additional_images": [
      "assets/topology/charqi1.jpg",
      "assets/topology/charqi2.jpg",
      "assets/topology/charqi.jpg"
    ]
}
,
{
  "name": "العرق الغربي الكبير",
  "type": "deserts",
  "position": [29.1, -1],
  "description": "العرق الغربي الكبير، المعروف أيضًا باسم بحر الرمال الغربي، هو ثاني أكبر عرق في الجزائر بمساحة 80,000 كم². يتميز بكثبانه الرملية التي تصل إلى 300 متر ارتفاعًا، ويفصله عن العرق الشرقي الكبير هضبة تادمايت. يعتبر من المناطق الصحراوية القاحلة ذات معدل هطول أمطار أقل من 25 ملم سنويًا، ولا توجد به تجمعات سكانية أو طرق، لكنه كان جزءًا من طرق القوافل التاريخية التي ربطت الواحات.",
  "image": "assets/topology/garbi2.jpg",
  "additional_images": [
      "assets/topology/garbi.jpg",
      "assets/topology/garbi1.jpg",
      "assets/topology/garbi3.jpg"
  ]
}
,
{
  "name": "الجوف",
  "type": "deserts",
  "position": [19, -7],
  "description": "الجوف منطقة صحراوية تقع في جنوب شرق ليبيا، وتعد المركز الإداري لبلدية الكفرة. تتميز بمناخ جاف وقلة هطول الأمطار، وتقع تقريبًا على مدار السرطان.",
  "image": "assets/topology/jawf3.jpg",

  "additional_images": [
    "assets/topology/jawf1.jpg",
    "assets/topology/jawf2.webp",
    "assets/topology/jawf.jpg"
]

}
,
{
  "name": "جبال الأطلس الصغير",
  "type": "mountains",
  "position": [29.8, -7.8],
  "description": "الأطلس الصغير هو سلسلة جبلية في جنوب المغرب تمتد لمسافة 500 كيلومتر، تحدها الصحراء من الجنوب. أعلى قمة فيها هي جبل سيروا بارتفاع 3304 متر. تتميز بتنوع جيولوجي وتضاريس وعرة، وتعتبر موطنًا تقليديًا للأمازيغ. مناخها جاف بمعدل أمطار سنوي أقل من 200 ملم، مما يؤثر على الغطاء النباتي الذي يشمل نباتات مقاومة للجفاف مثل الأرغان وإكليل الجبل.",
  "image": "assets/topology/small_atlas.jpg",
  "additional_images": [
    "assets/topology/small_atlas1.png",
    "assets/topology/small_atlas2.jpg",
    "assets/topology/small_atlas3.jpg"
]
}
,
{
  "name": "الأطلس الأوسط",
  "type": "mountains",
  "position": [33, -5.1],
  "description": "الأطلس الأوسط سلسلة جبلية في المغرب تمتد بين الأطلس الكبير والصغير، وتشكل خزانًا مائيًا مهمًا حيث تنبع منه معظم أنهار البلاد. يتميز بتنوعه البيئي، إذ يضم أكبر غابة أرز في العالم ويعد موطنًا للقرد البري. أعلى قمة فيه هي بوناصر بارتفاع 3340 متر، كما تغطيه غابات البلوط الأخضر والعرعار. يعد من أهم المناطق الزراعية في المغرب، خاصة لإنتاج الفواكه مثل التفاح والكرز.",
  "image": "assets/topology/med_atlas.jpg",
  "additional_images": [
      "assets/topology/med_atlas1.jpg",
      "assets/topology/med_atlas2.jpg",
      "assets/topology/med_atlas3.jpg"
  ]
}
,
{
  "name": "الأطلس الصحراوي",
  "type": "mountains",
  "position": [33, -1],
  "description": "الأطلس الصحراوي سلسلة جبلية تمتد من الحدود التونسية شرقًا إلى الحدود المغربية غربًا، موازية للأطلس التلي. تتكون من عدة سلاسل مثل جبال القصور، جبال العمور، وجبال الأوراس، التي تضم أعلى قمة في السلسلة، جبل شيليا (2328 م). تمر بها عدة وديان رئيسية مثل وادي الشارف، وادي الشلف، ووادي امزي، مما يجعلها ذات أهمية هيدرولوجية.",
  "image": "assets/topology/sahrawi_atlas3.jpg",
  "additional_images": [
      "assets/topology/sahrawi_atlas.jpg",
      "assets/topology/sahrawi_atlas2.jpg",
      "assets/topology/sahrawi_atlas1.jpg"
  ]
}
,
{
  "name": "جبال الأطلس الكبير",
  "type": "mountains",
  "position": [31.5, -6],
  "description": "جبال الأطلس الكبير هي الجزء الأعلى من سلسلة جبال الأطلس في المملكة المغربية الشريفة. تمتد من غرب أكادير على المحيط الأطلسي شمالاً وشرقاً، وتضم أعلى قمة في شمال إفريقيا، جبل توبقال بارتفاع 4165 متر جنوب مراكش. تنقسم السلسلة إلى كتلتين يفصل بينهما ممر تالوين، مما يؤدي إلى اختلاف مناخي بين المنطقة الشرقية الصحراوية والمنطقة الغربية الرطبة. كما تعرف باسم 'جبل الحياة' تقديراً لأهميتها كمصدر للماء والحياة لدى السكان المحليين.",
  "image": "assets/topology/big_atlas.webp",
  "additional_images": [
      "assets/topology/big_atlas1.jpg",
      "assets/topology/big_atlas2.jpg",
      "assets/topology/big_atlas3.jpg"
  ]
}
,
{
  "name": "جبال الريف",
  "type": "mountains",
  "position": [34.5, -4.5],
  "description": "جبال الريف هي سلسلة جبلية كبيرة في شمال المغرب تمتد بمحاذاة ساحل البحر الأبيض المتوسط من مضيق جبل طارق حتى نهر ملوية. تشتهر بتساقط أمطار غزيرة أدت إلى نمو غطاء نباتي كثيف وازدهار الزراعة والرعي. كما تتميز بتاريخها العريق، بدءًا من عهود ما قبل التاريخ مرورًا بفترة الحماية الإسبانية لعاصمتها تطوان، وتنتمي جيولوجياً إلى نظام جبل طارق كامتداد لنظام جبال شبه الجزيرة الأيبيرية، مع قمة جبل تيدغين التي تبلغ ارتفاعها 2456 متر.",
  "image": "assets/topology/rif1.jpg",
  "additional_images": [
    "assets/topology/rif.jpg",
    "assets/topology/rif2.jpg",
    "assets/topology/rif3.jpg"
]
}
,
{
  "name": "السلسلة التلية",
  "type": "mountains",
  "position": [35.8, 7],
  "description": "السلسلة التلية هي سلسلة جبلية تمتد أساساً في شمال الجزائر وتمتد نحو شمال شرق المغرب وغرب تونس. تُعرف أحياناً بالأطلس الصغير (دون الخلط مع الأطلس الصغير المغربي) وتحدها جبال الريف من الغرب في القطاع الوهراني. تمتد لحوالي 1500 كيلومتر بمحاذاة البحر الأبيض المتوسط، وتبلغ أعلى قممها جبل لالة خديجة بارتفاع 2308 متر في جبال جرجرة. تشكل مع الأطلس الصحراوي نظاماً متوازياً يتخلله سهول وهضاب خصبة وغنية بالنباتات والحيوانات، ويمر بهما وادي الشلف ووادي الحضنة بسطيف.",
  "image": "assets/topology/taleya.jpg",
  "additional_images": [
      "assets/topology/taleya1.jpg",
      "assets/topology/taleya2.jpg",
      "assets/topology/taleya3.jpg"
  ]
}
,
{
  "name": "جبال تاسيلي ناجر",
  "type": "mountains",
  "position": [24.8, 9],
  "description": "تُعرف جبال تاسيلي ناجر – أو تاسيلي نعاجر، التي تعني 'هضبة الثور' – بكونها سلسلة جبلية تقع في قلب الصحراء بالجزائر وجزئياً في ليبيا. تتميز هذه الهضبة القاحلة، التي تمتد على مساحة تقارب 72,000 كم² مع عرض 50-60 كم وطول 800 كم، بارتفاع يزيد عن 2000 متر، حيث تبلغ أعلى قممها (أدرار أفاو) 2158 متر. تشتهر بتشكيلاتها الصخرية المتآكلة، التي تُعرف بالغابات الصخرية، ونقوشها الكهفية القديمة التي تعود إلى ما قبل التاريخ. تُقسم المنطقة إلى ثلاث أقسام جغرافية مميزة: الطاسيلي الداخلي، الطاسيلي الخارجي، والأخدود أسفل الطاسيلي، مما يعكس تاريخها الجيولوجي الطويل وعملية التعرية المستمرة بفعل الأمطار النادرة والرياح والعوامل الحرارية.",
  "image": "assets/topology/tasili3.jpg",
  "additional_images": [
      "assets/topology/tasili1.jpg",
      "assets/topology/tasili2.jpg",
      "assets/topology/tasili.jpg"
  ]
}
,
{
  "name": "جبل توبقال",
  "type": "peaks",
  "position": [30.9, -8.9],
  "description": "يُعد جبل توبقال أعلى قمة في سلسلة جبال الأطلس الكبير وأعلى قمة في المغرب وشمال إفريقيا والوطن العربي، إذ يرتفع إلى 4167 مترًا. يقع في جنوب غرب المغرب على بعد 82 كم جنوب مدينة مراكش داخل متنزه توبقال الوطني الذي تبلغ مساحته 380 كم². يتميز الجبل بكتلته البركانية التي تشقها وديان عميقة، مع ممر تيزي نونمس الذي يصل إلى 3664 مترًا ويسهم في تسهيل الوصول إلى قممه. كما تحيط به تسميات أمازيغية مثل 'تيزي ن توݣ أکال' و'أدرار ن درن'، مما يعكس مكانته الروحية والتاريخية لدى السكان المحليين والقدماء.",
  "image": "assets/topology/tobqal2.jpg",
  "additional_images": [
    "assets/topology/tobqal3.jpg",
    "assets/topology/tobqal.jpg",
    "assets/topology/tobqal2.jpg"
]
}
,
{
  "name": "جبل أوراس",
  "type": "peaks",
  "position": [35.1, 7],
  "description": "جبال الأوراس هي سلسلة جبال عالية القمم تقع في شمال شرق الجزائر، وتمتد عبر ولايات باتنة، خنشلة، أم البواقي وتبسة. تشكل القسم الشرقي من الأطلس الصحراوي وتضم قمة جبل شيليا التي تبلغ 2328 مترًا، بالإضافة إلى قمم مثل جبل المحمل وقمة أشمول. تُعرف هذه الجبال بكونها موطنًا للأمازيغ وتشكل جسرًا طبيعيًا يمتد نحو تونس مع تنوع بين الجبال والسهول.",
  "image": "assets/topology/oras2.webp",
  "additional_images": [
    "assets/topology/oras1.jpg",
    "assets/topology/oras.jpg",
    "assets/topology/oras3.jpg"
]
}
,
{
  "name": "جبل الأحجار",
  "type": "peaks",
  "position": [24, 5.5],
  "description": "تُعد جبال الأحجار سلسلة جبلية تمتد في الركن الجنوبي الشرقي من شبه الجزيرة العربية، حيث تغطي جزءًا كبيرًا من شمال سلطنة عمان وبعض المناطق الشمالية لدولة الإمارات العربية المتحدة. تمتد السلسلة على شكل قوس عظيم يبدأ من رؤوس الجبال في رأس مسندم بالقرب من مضيق هرمز ويصل إلى رأس الحد في المنطقة الشرقية من عمان، مع ارتفاعات تصل إلى 3000 متر في منطقة الجبل الأخضر. تنقسم الجبال إلى قسمين: جبال الحجر الغربي، التي تضم منطقة الجبل الأخضر ومدن الرستاق ونخل والعوابي، وجبال الحجر الشرقي، التي تقع شرق وادي سمائل وتضم مدن سمائل وبدبد، ويفصل بينهما وادي سمائل الممتد من مدينة مسقط إلى مدن داخلية مثل أزكي ونزوى.",
  "image": "assets/topology/ahjar.jpg",
  "additional_images": [
      "assets/topology/ahjar1.jpg",
      "assets/topology/ahjar2.jpg",
      "assets/topology/ahjar3.jpg"
  ]
}
,
{
  "name": "جبل الشعانبي",
  "type": "peaks",
  "position": [35.4, 8.8],
  "description": "يُعتبر جبل الشعانبي أعلى مرتفع في تونس بارتفاع 1544 مترًا، ويقع في الوسط الغربي للتونس. يتميز بغطائه الوفير من غابات الصنوبر الحلبي، ويُحيط به المنتزه الوطني بالشعانبي في ولاية القصرين، الذي يمتد على مساحة 6723 هكتارًا منذ ديسمبر 1980. تحتوي هذه المنطقة المحمية على 262 جنسًا نباتيًا و24 فصيلة من الثدييات و16 نوعًا من الزواحف، مما يعكس تنوعها البيولوجي الفريد.",
  "image": "assets/topology/chaambi2.jpg",
  "additional_images": [
      "assets/topology/chaambi1.jpg",
      "assets/topology/chaambi.jpg",
      "assets/topology/chaambi3.jpg"
  ]
}

]
